import React, { useState, useEffect } from 'react';
import axios from 'axios';
import { Link } from 'react-router-dom';
import 'C:/Users/admin/incorpr repository/incorpr_react/src/static/staff.css';
import 'C:/Users/admin/incorpr repository/incorpr_react/src/static/index.css';
import Header from 'C:/Users/admin/incorpr repository/incorpr_react/src/templates/blocks/header';
import Footer from 'C:/Users/admin/incorpr repository/incorpr_react/src/templates/blocks/footer';

const Staff = () => {
    const [staff, setStaff] = useState([]);
    const [error, setError] = useState(null);

    useEffect(() => {
        const fetchStaff = async () => {
            try {
                const response = await axios.get('http://localhost:8080/staff/all');
                const sortedStaff = response.data.sort((a, b) => b.id - a.id);
                setStaff(sortedStaff);
            } catch (err) {
                setError('Ошибка при загрузке данных сотрудников. Попробуйте еще раз.');
            }
        };

        fetchStaff();
    }, []);

    const handleDelete = async (id) => { 
        try { 
            await axios.post(`http://localhost:8080/api/users/${id}/delete`); 
            setStaff(staff.filter((employee) => employee.id !== id)); 
        } catch (err) { 
            setError('Ошибка при удалении пользователя. Попробуйте еще раз.'); 
        } 
    };

    return (
        <div className="body-staff">
            <Header />
            <main className="container-staff">
                <div className="main-content-staff">
                    <h2>Сотрудники</h2>
                    <div className="head-staff">
                        <svg width="20" height="25" viewBox="0 0 20 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                        </svg>
                    </div>
                    <div className="section-staff">
                        {error ? <p>{error}</p> : staff.map((employee) => (
                            <Link to={`/staff/${employee.id}`} className="link-staff" key={employee.id}>
                                <div className="employee-staff">
                                    <div className="employee-info-staff">
                                        <img className="avatar-staff" src={`http://localhost:8080${employee.avatarUrl}`} alt={`avatar of ${employee.username}`} />
                                        <p className="username-staff">{employee.username}</p>
                                        <p className="position-staff">{employee.position}</p>
                                    </div>
                                    <div className="icons-staff">
                                        <Link to={`/staff/${employee.id}/edit`} className="link-staff">
                                            <svg className="edit-icon-staff" width="30" height="30" viewBox="0 0 27 27" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M1.18915 26.5001H25.7366C25.9293 26.5001 26.114 26.4234 26.2502 26.2867C26.3864 26.1501 26.4629 25.9648 26.4629 25.7715C26.4629 25.5783 26.3864 25.393 26.2502 25.2563C26.114 25.1197 25.9293 25.0429 25.7366 25.0429H1.18915C0.996532 25.0429 0.811806 25.1197 0.675606 25.2563C0.539407 25.393 0.462891 25.5783 0.462891 25.7715C0.462891 25.9648 0.539407 26.1501 0.675606 26.2867C0.811806 26.4234 0.996532 26.5001 1.18915 26.5001ZM10.1395 21.0239C10.7528 20.8509 11.3124 20.5251 11.7664 20.0767L25.6233 6.17492C26.0979 5.69697 26.3643 5.04986 26.3643 4.37527C26.3643 3.70067 26.0979 3.05356 25.6233 2.57561L24.258 1.2204C23.7745 0.758043 23.1321 0.500122 22.4641 0.500122C21.7961 0.500122 21.1538 0.758043 20.6703 1.2204L6.81328 15.1076C6.36644 15.5607 6.0459 16.1235 5.88367 16.7397L4.80881 20.7616C4.75828 20.9454 4.75719 21.1393 4.80567 21.3236C4.85415 21.5079 4.95046 21.676 5.08479 21.8108C5.29064 22.0132 5.56642 22.128 5.85462 22.1314L10.1395 21.0239ZM10.7351 19.0421C10.4672 19.3155 10.1311 19.5118 9.76188 19.6104L8.35295 19.9893L6.90043 18.5321L7.27809 17.1186C7.37837 16.749 7.57373 16.4123 7.84457 16.1423L8.39652 15.6031L11.287 18.5029L10.7351 19.0421ZM12.3183 17.4683L9.42781 14.5685L19.2032 4.76143L22.0937 7.66128L12.3183 17.4683ZM24.5921 5.15488L23.125 6.62666L20.2345 3.72681L21.7016 2.24045C21.9058 2.03578 22.1827 1.92083 22.4714 1.92083C22.7601 1.92083 23.037 2.03578 23.2412 2.24045L24.5921 3.61023C24.7947 3.8159 24.9083 4.0934 24.9083 4.38255C24.9083 4.67171 24.7947 4.94921 24.5921 5.15488Z" fill="#252525"/>
                                            </svg>
                                        </Link>
                                        <Link className="link-staff">
                                            <svg onClick={() => handleDelete(employee.id)} className="delete-icon-staff" width="35" height="37" viewBox="0 0 31 33" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M25.3546 6.24422H19.9554V5.59839C19.9554 5.08453 19.7513 4.59172 19.3879 4.22837C19.0246 3.86502 18.5317 3.66089 18.0179 3.66089H13.4454C12.9315 3.66089 12.4387 3.86502 12.0754 4.22837C11.712 4.59172 11.5079 5.08453 11.5079 5.59839V6.24422H6.10872C5.93744 6.24422 5.77317 6.31226 5.65205 6.43338C5.53093 6.5545 5.46289 6.71877 5.46289 6.89006C5.46289 7.06134 5.53093 7.22561 5.65205 7.34673C5.77317 7.46785 5.93744 7.53589 6.10872 7.53589H7.03872L7.58122 26.2005C7.60249 27.0419 7.95235 27.8415 8.5559 28.4282C9.15946 29.0148 9.96871 29.3419 10.8104 29.3392H20.6529C21.4946 29.3419 22.3038 29.0148 22.9074 28.4282C23.5109 27.8415 23.8608 27.0419 23.8821 26.2005L24.4246 7.53589H25.3546C25.5258 7.53589 25.6901 7.46785 25.8112 7.34673C25.9323 7.22561 26.0004 7.06134 26.0004 6.89006C26.0004 6.71877 25.9323 6.5545 25.8112 6.43338C25.6901 6.31226 25.5258 6.24422 25.3546 6.24422ZM12.7996 5.59839C12.7996 5.4271 12.8676 5.26283 12.9887 5.14172C13.1098 5.0206 13.2741 4.95256 13.4454 4.95256H18.0179C18.1892 4.95256 18.3534 5.0206 18.4746 5.14172C18.5957 5.26283 18.6637 5.4271 18.6637 5.59839V6.24422H12.7996V5.59839ZM22.5904 26.1617C22.5769 26.6666 22.3669 27.1462 22.005 27.4985C21.6431 27.8507 21.1579 28.0477 20.6529 28.0476H10.8104C10.3054 28.0477 9.82022 27.8507 9.45832 27.4985C9.09642 27.1462 8.88636 26.6666 8.87289 26.1617L8.31747 7.53589H23.1458L22.5904 26.1617Z" fill="#252525"/>
                                                <path d="M11.0498 11.3333C11.0498 11.162 11.1178 10.9978 11.239 10.8767C11.3601 10.7555 11.5244 10.6875 11.6956 10.6875C11.8669 10.6875 12.0312 10.7555 12.1523 10.8767C12.2734 10.9978 12.3415 11.162 12.3415 11.3333L12.6644 24.25C12.6644 24.4213 12.5963 24.5856 12.4752 24.7067C12.3541 24.8278 12.1898 24.8958 12.0186 24.8958C11.8473 24.8958 11.683 24.8278 11.5619 24.7067C11.4408 24.5856 11.3727 24.4213 11.3727 24.25L11.0498 11.3333ZM20.4144 11.3424C20.4144 11.1711 20.3463 11.0068 20.2252 10.8857C20.1041 10.7646 19.9398 10.6965 19.7686 10.6965C19.5973 10.6965 19.433 10.7646 19.3119 10.8857C19.1908 11.0068 19.1227 11.1711 19.1227 11.3424L18.7998 24.259C18.7998 24.4303 18.8678 24.5946 18.989 24.7157C19.1101 24.8368 19.2744 24.9049 19.4456 24.9049C19.6169 24.9049 19.7812 24.8368 19.9023 24.7157C20.0234 24.5946 20.0915 24.4303 20.0915 24.259L20.4144 11.3424Z" fill="#252525"/>
                                            </svg>
                                        </Link>
                                    </div>
                                </div>
                            </Link>
                        ))}
                    </div>
                </div>
            </main>
            <Footer />
        </div>
    );
};

export default Staff;